https://www.datamanim.com/dataset/practice/q1.html

In [ ]:
# 작업 1유형

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')

Question1. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 인원을 가진 나이대는? ({0:9} = 0 , {10:19} = 10)
Question2. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 나이대 구간의 인원은 몇명인가?

In [18]:
df['연령대'] = df['age'].astype("str").apply(lambda x : x[0]+"0" if len(x)==2 else 0)
df.value_counts("연령대").head(1)

연령대
30    5056
dtype: int64

Question3. 나이가 25살 이상 29살 미만인 응답 고객들중 housing컬럼의 값이 yes인 고객의 수는?

In [24]:
df.drop(columns = "연령대",inplace= True)
df[(df['age']>=25) & (df['age']<29)].value_counts("housing")[0]

504

Question4. numeric한 값을 가지지 않은 컬럼들중 unique한 값을 가장 많이 가지는 컬럼은?

In [52]:
non_numeric_col = df.dtypes[df.dtypes== object].index.values
result = {}
for col in non_numeric_col:
    result[col] = df[col].nunique()
result = pd.DataFrame(result.values(),result.keys())
result.rename(columns = {0:"Count"},inplace=True)
result.sort_values("Count",ascending = False).head(2)

       Count
job       12
month     12

Question5. balance 컬럼값들의 평균값 이상을 가지는 데이터를 ID값을 기준으로 내림차순 정렬했을때 상위 100개 데이터의 balance값의 평균은?

In [55]:
df[df['balance']>=df['balance'].mean()].sort_values("ID",ascending=False).head(100)['balance'].mean()

3473.73

Question6. 가장 많은 광고를 집행했던 날짜는 언제인가? (데이터 그대로 일(숫자),달(영문)으로 표기)

In [72]:
df.groupby(["month",'day']).count()['ID'].sort_values(ascending = False).index[0]

('may', 15)

Question7. age와 balance의 상관계수를 구하여라

In [76]:
import numpy as np
np.round(np.corrcoef(df['age'],df['balance'])[0][1],4)

0.102

Question8. y 변수와 education 변수는 독립인지 카이제곱검정을 통해 확인하려한다. p-value값을 출력하라

In [82]:
v = pd.crosstab(df.y,df.education)
from scipy.stats import chi2_contingency
chi2 , p ,dof, expected = chi2_contingency(v)
display(v)
print(p)

education  primary  secondary  tertiary  unknown
y
no            1424       4555      2559      365
yes            456       1813      1516      182

7.901201277473551e-29

Question9 각 job에 따라 divorced/married 인원의 비율을 확인 했을 때 그 값이 가장 높은 값은?

In [112]:
result = df.groupby(["job","marital"]).size().reset_index().pivot_table(index="job",columns = "marital")[0]
result['single'] = result['divorced']/result['married']
result['single'].max()

0.2831050228310502

In [85]:
df

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12865,14023,47,technician,married,secondary,no,1167,yes,no,cellular,30,apr,1,87,5,failure,yes
12866,17259,31,unknown,married,secondary,no,111,no,no,cellular,21,nov,2,93,2,failure,yes
12867,15200,37,unemployed,single,tertiary,no,1316,yes,no,cellular,18,nov,1,172,2,failure,no
12868,13775,42,management,married,tertiary,no,479,yes,no,unknown,28,may,2,-1,0,unknown,no
12869,20137,24,services,single,secondary,no,0,no,no,unknown,16,may,1,-1,0,unknown,no